'use strict'

/**
*Функция отечающая за добавление новой задачи.
*Требуется:
*	1.Указать такой REST API URL предоставляемый RESTForms, добавить в базу новую задачу.
*	2.Указать тип запроса.
*	3.Заполнить обьект с отправляемыми данными согласно требованиям.
*/
function postTaskAJAX(text, category_id)
{
	/*category_id - id категории ,к которой будет привязана новая задача*/
	/*text - текст задачи*/

	var post_obj = { /*Отправляемый обьект*/
	
	}

    var post_body = JSON.stringify(post_obj)

	$.ajax({
        url: '', /*Сюда введите URL запроса*/
        type: '', /*Сюда введите тип запроса*/
        contentType: 'application/json',










//===================Код не относящийся к заданию==========================================
        data: post_body,

        success: function(data) {
            addTask(data.Id, text, false);
            $('input#myInput').val('');
        },
        dataType: 'json'   
    });
}
//===========================================================================================